# Koşullu Eleman İşlemleri

In [5]:
import pandas as pd
import numpy as np

In [8]:
m = np.random.randint(1,30,size=(10,3))
df1 = pd.DataFrame(m, columns= ["var1","var2","var3"])
df1

   var1  var2  var3
0     9    15    13
1     6    24     5
2    12    21    10
3    26     7    27
4     2    21    14
5    26    11    28
6    27    11    28
7     7    21    23
8     2     6    17
9    12     2    13

In [5]:
# var1'deki değişkenlerin 15'ten büyük olması durumunu ele alalım.

df1[df1.var1 > 15]

#Seçme işlemini "dataframe_ismi.değişken_ismi" şeklinde de yapabiliriz.

   var1  var2  var3
2    19    11    18
5    28    24     6
6    19    25    14
7    23    13    26
8    16     2    12

In [8]:
# var1>15 iken diğer değişkenlerin durumlarını inceleyelim

df1[df1.var1 > 15][["var2","var3"]]

   var2  var3
2    11    18
5    24     6
6    25    14
7    13    26
8     2    12

In [13]:
#Çoklu koşul işlemleri yapalım.
#var1<18 ve var2>13 ve var3<23 iken durumlarını inceleyelim.

df1[(df1.var1<18) & (df1.var2>13) & (df1.var3<23)]#[["var1","var2","var3"]]

   var1  var2  var3
9    13    27    11

In [14]:
df1.loc[df1.var2>13, ["var1","var3"]]

   var1  var3
5    28     6
6    19    14
9    13    11